Процедура Выполнить()
  Если Параметры.ДемоБаза <> Истина Тогда
    ВызватьИсключение("Обработка предназначена только для демонстрационной базы");
  КонецЕсли;
  Организация = Справочники.Организация.НайтиПоНаименованию("ООО «Табуретка-Люкс»");
  Склад = Справочники.Склад.НайтиПоНаименованию("Главный склад «Где-то там»");
  Покупатель = Справочники.Контрагент.НайтиПоНаименованию("Кафе «Три Стула»");
  Поставщик = Справочники.Контрагент.НайтиПоНаименованию("ООО «Дерево и Гвозди»");
  Товар = Справочники.Номенклатура.НайтиПоНаименованию("Табурет «Шаткий-2000»");
  ТипЦен = Справочники.ТипЦен.НайтиПоНаименованию("Розничная");
  Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Склад)
     ИЛИ НЕ ЗначениеЗаполнено(Покупатель) ИЛИ НЕ ЗначениеЗаполнено(Поставщик)
     ИЛИ НЕ ЗначениеЗаполнено(Товар) ИЛИ НЕ ЗначениеЗаполнено(ТипЦен) Тогда
    ВызватьИсключение("Сначала заполните базовые демонстрационные данные");
  КонецЕсли;
  ДатаПримеров = ТекущаяДатаВремя();
  Если ЗначениеЗаполнено(Параметры.ОпорнаяДата) Тогда ДатаПримеров = Параметры.ОпорнаяДата; КонецЕсли;
  ЗаполнитьДемоЭтапыЗаказовПУТ(ДатаПримеров, Организация, Склад, Покупатель, Поставщик, Товар, ТипЦен);
КонецПроцедуры
