Процедура ПриЗаписи()
  Если ЗначениеЗаполнено(this.Организация) = Ложь Тогда
    this.Организация = ОрганизацияПоУмолчанию();
  КонецЕсли;
  Если ЗначениеЗаполнено(this.Склад) = Ложь Тогда
    this.Склад = СкладПоУмолчанию();
  КонецЕсли;
  Если ЗначениеЗаполнено(this.Склад) = Ложь Тогда
    Error("Укажите склад");
  КонецЕсли;
  Если this.Расход.Количество() = 0 Тогда
    Error("Добавьте комплектующие в табличную часть Расход");
  КонецЕсли;
  Если this.Приход.Количество() = 0 Тогда
    Error("Добавьте готовую продукцию в табличную часть Приход");
  КонецЕсли;

  Для Каждого Строка Из this.Расход Цикл
    Если ЗначениеЗаполнено(Строка.Номенклатура) = Ложь Тогда
      Error("В табличной части Расход есть строка без номенклатуры");
    КонецЕсли;
    Если Строка.Количество <= 0 Тогда
      Error("Количество должно быть больше нуля: «" + Строка(Строка.Номенклатура) + "»");
    КонецЕсли;
  КонецЦикла;

  Для Каждого Строка Из this.Приход Цикл
    Если ЗначениеЗаполнено(Строка.Номенклатура) = Ложь Тогда
      Error("В табличной части Приход есть строка без номенклатуры");
    КонецЕсли;
    Если Строка.Количество <= 0 Тогда
      Error("Количество должно быть больше нуля: «" + Строка(Строка.Номенклатура) + "»");
    КонецЕсли;
  КонецЦикла;
КонецПроцедуры
