Процедура ПриЗаписи()
  Если ЗначениеЗаполнено(this.Организация) = Ложь Тогда
    this.Организация = ОрганизацияПоУмолчанию();
  КонецЕсли;
  Если ЗначениеЗаполнено(this.Склад) = Ложь Тогда
    this.Склад = СкладПоУмолчанию();
  КонецЕсли;
  Если ЗначениеЗаполнено(this.Склад) = Ложь Тогда
    Error("Укажите склад");
  КонецЕсли;
  Если this.Товары.Количество() = 0 Тогда
    Error("Добавьте хотя бы одну строку в табличную часть Товары");
  КонецЕсли;

  Для Каждого Строка Из this.Товары Цикл
    Если ЗначениеЗаполнено(Строка.Номенклатура) = Ложь Тогда
      Error("В табличной части есть строка без номенклатуры");
    КонецЕсли;
    Если Строка.Количество <= 0 Тогда
      Error("Количество должно быть больше нуля: «" + Строка(Строка.Номенклатура) + "»");
    КонецЕсли;
  КонецЦикла;
КонецПроцедуры
