// Банковский ордер на списание денег с расчётного счёта.
// Поведение симметрично РКО, но касса должна быть только банковским счётом.

Процедура ОбработкаПроведения()
  Движения.ДенежныеСредства.Очистить();
  Движения.Взаиморасчеты.Очистить();

  ДвДС = Движения.ДенежныеСредства.Добавить();
  ДвДС.ВидДвижения = "Расход";
  ДвДС.Касса       = this.БанковскийСчёт;
  ДвДС.Организация = this.Организация;
  ДвДС.Сумма       = this.Сумма;
  ДвДС.Контрагент  = this.Контрагент;
  ДвДС.Основание   = this.НазначениеПлатежа;

  ДвВз = Движения.Взаиморасчеты.Добавить();
  ДвВз.ВидДвижения        = "Приход";
  ДвВз.Контрагент         = this.Контрагент;
  ДвВз.Организация        = this.Организация;
  ДвВз.ТипКонтрагента     = this.Контрагент.Вид;
  ДвВз.ДокументРеализации = this.ДокументРеализации;
  ДвВз.ДокументПоступления = this.ДокументПоступления;
  ДвВз.Сумма              = this.Сумма;
КонецПроцедуры
